10/data/attachments/95438f799e5d3784.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Amy_sense_Friend_63219_8</nif:username>
            <nif:friendToBeRequested>soap_friends_335b587d-4b17-491c-beab-a5e09d5c7364</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>